Revit 2027 API
HostedSweep.ReferenceCurve Property
The curve on which the hosted sweep segment is created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve this[
	Reference targetRef
] { get; }
Public ReadOnly Property ReferenceCurve (
	targetRef As Reference
) As Curve
	Get
public:
property Curve^ ReferenceCurve[Reference^ targetRef] {
	Curve^ get (Reference^ targetRef);
}
member ReferenceCurve : Curve with get
Parameters
targetRef Reference
Reference of the curve that hosts the object.
Property Value
Curve
Exceptions
Exception | Condition
InvalidOperationException | Thrown when regeneration fails.
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace